app/Domestic/Files/3/GetFlightDetailRQ.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <GetFlightDetail xmlns="http://booking.us.dev/">
            <strUserId xmlns="">ASIANL</strUserId>
            <strFlightId xmlns="">a2b080c7-cbff-4132-af0e-3ce4779fd244</strFlightId>
        </GetFlightDetail>
    </Body>
</Envelope